zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_jh/pic32cm_jh00/pic32cm2532jh00064-pinctrl.h
/* pb15k_ptc_ds31 */
#define PB15K_PTC_DS31 MCHP_PINMUX(b, 15, k, periph)

/* pb16_gpio */
#define PB16_GPIO MCHP_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 MCHP_PINMUX(b, 16, a, periph)

/* pb16c_sercom5_pad0 */
#define PB16C_SERCOM5_PAD0 MCHP_PINMUX(b, 16, c, periph)

/* pb16e_tc2_wo0 */
#define PB16E_TC2_WO0 MCHP_PINMUX(b, 16, e, periph)

/* pb16f_tcc0_wo4 */
#define PB16F_TCC0_WO4 MCHP_PINMUX(b, 16, f, periph)

/* pb16h_gclk_io2 */
#define PB16H_GCLK_IO2 MCHP_PINMUX(b, 16, h, periph)

/* pb16i_ccl_in11 */
#define PB16I_CCL_IN11 MCHP_PINMUX(b, 16, i, periph)

/* pb17_gpio */
#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 MCHP_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 MCHP_PINMUX(b, 17, c, periph)

/* pb17e_tc2_wo1 */
#define PB17E_TC2_WO1 MCHP_PINMUX(b, 17, e, periph)

/* pb17f_tcc0_wo5 */
#define PB17F_TCC0_WO5 MCHP_PINMUX(b, 17, f, periph)

/* pb17h_gclk_io3 */
#define PB17H_GCLK_IO3 MCHP_PINMUX(b, 17, h, periph)

/* pb17i_ccl_out3 */
#define PB17I_CCL_OUT3 MCHP_PINMUX(b, 17, i, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 MCHP_PINMUX(b, 22, d, periph)

/* pb22e_tc3_wo0 */
#define PB22E_TC3_WO0 MCHP_PINMUX(b, 22, e, periph)

/* pb22h_gclk_io0 */
#define PB22H_GCLK_IO0 MCHP_PINMUX(b, 22, h, periph)

/* pb22i_ccl_in0 */
#define PB22I_CCL_IN0 MCHP_PINMUX(b, 22, i, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 MCHP_PINMUX(b, 23, d, periph)

/* pb23e_tc3_wo1 */
#define PB23E_TC3_WO1 MCHP_PINMUX(b, 23, e, periph)

/* pb23h_gclk_io1 */
#define PB23H_GCLK_IO1 MCHP_PINMUX(b, 23, h, periph)

/* pb23i_ccl_out0 */
#define PB23I_CCL_OUT0 MCHP_PINMUX(b, 23, i, periph)

/* pb30_gpio */
#define PB30_GPIO MCHP_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 MCHP_PINMUX(b, 30, a, periph)

/* pb30d_sercom5_pad0 */
#define PB30D_SERCOM5_PAD0 MCHP_PINMUX(b, 30, d, periph)

/* pb30e_tcc0_wo0 */
#define PB30E_TCC0_WO0 MCHP_PINMUX(b, 30, e, periph)

/* pb30f_tcc1_wo2 */
#define PB30F_TCC1_WO2 MCHP_PINMUX(b, 30, f, periph)

/* pb30h_ac_cmp2 */
#define PB30H_AC_CMP2 MCHP_PINMUX(b, 30, h, periph)

/* pb31_gpio */
#define PB31_GPIO MCHP_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 MCHP_PINMUX(b, 31, a, periph)

/* pb31d_sercom5_pad1 */
#define PB31D_SERCOM5_PAD1 MCHP_PINMUX(b, 31, d, periph)

/* pb31e_tcc0_wo1 */
#define PB31E_TCC0_WO1 MCHP_PINMUX(b, 31, e, periph)

/* pb31f_tcc1_wo3 */
#define PB31F_TCC1_WO3 MCHP_PINMUX(b, 31, f, periph)

/* pb31h_ac_cmp3 */
#define PB31H_AC_CMP3 MCHP_PINMUX(b, 31, h, periph)

#endif /* MICROCHIP_PIC32CM2532JH00064_PINCTRL_H_ */
